CSI API ETABS v1
cCaseModalEigen.SetNumberModes Method
 This function sets the number of modes requested for the specified load case.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int SetNumberModes(
	string Name,
	int MaxModes,
	int MinModes
)
Function SetNumberModes (
	Name As String,
	MaxModes As Integer,
	MinModes As Integer
) As Integer
Dim instance As cCaseModalEigen
Dim Name As String
Dim MaxModes As Integer
Dim MinModes As Integer
Dim returnValue As Integer
returnValue = instance.SetNumberModes(Name,
	MaxModes, MinModes)
int SetNumberModes(
	String^ Name,
	int MaxModes,
	int MinModes
)
abstract SetNumberModes :
        Name : string *
        MaxModes : int *
        MinModes : int -> int
Parameters
Name
Type: System.String
 The name of an existing modal Eigen load case.
MaxModes
Type: System.Int32
 The maximum number of modes requested.
MinModes
Type: System.Int32
 The minimum number of modes requested.
Return Value
Type: Int32
 The function returns zero if the number of modes is successfully set; otherwise it returns a nonzero value.
Remarks
Examples
Public Sub Example()
   Dim SapModel As cSapModel
   Dim EtabsObject As cOAPI
   Dim ret As Integer = -1
'create ETABS object
   Dim myHelper as cHelper = New Helper
   EtabsObject = myHelper.CreateObjectProgID("CSI.ETABS.API.ETABSObject")
'start ETABS application
  ret = EtabsObject.ApplicationStart()
'create SapModel object
   SapModel = EtabsObject.SapModel
'initialize model
   ret = SapModel.InitializeNewModel()
'create steel deck template model
    ret = SapModel.File.NewSteelDeck(4, 12, 12, 4, 4, 24, 24)
'add modal Eigen load case
    ret = SapModel.LoadCases.ModalEigen.SetCase("LCASE1")
'get load data
   ret = mySapModel.LoadCases.ModalEigen.SetNumberModes("LCASE1", 10, 2)
'close ETABS
   EtabsObject.ApplicationExit(False)
'clean up variables
   SapModel = Nothing
   EtabsObject = Nothing
End Sub
See Also
Reference
cCaseModalEigen Interface
ETABSv1 Namespace